app/views/calendar/show.html.erb

SELECT "appointments".* FROM "appointments"  ORDER BY "appointments"."fecha" ASC
---
      <ul>
        <!-- % Appointment.all.order(fecha: :asc).each do |c| % -->

SELECT "patients".* FROM "patients" INNER JOIN "appointments" ON "appointments"."patient_id" = "patients"."id" INNER JOIN "us_pat_rels" ON "us_pat_rels"."patient_id" = "patients"."id" WHERE (user_id = 1)  ORDER BY appointments.fecha asc
SELECT  "physicians".* FROM "physicians" WHERE "physicians"."id" = ? LIMIT 1  [["id", 1]]
---
          <% if c.fecha.to_date == date %>
            <% @patient = Patient.find(c.patient_id) %>
            <% @physician = Physician.find(c.physician_id) %>