app/views/patients/show.html.erb

SELECT COUNT(*) FROM "records" WHERE "records"."patient_id" = ?  [["patient_id", 2]]
---
<% end %>
<% if @patient.records.count > 0 %>

SELECT  "records".* FROM "records" WHERE "records"."patient_id" = ?  ORDER BY "records"."fecha" DESC LIMIT 3  [["patient_id", 2]]
---
		<table>
			<% @patient.records.order(fecha: :desc).take(3).each do |record| %>