app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("patient_id", "physician_id", "fecha", "reminded", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["patient_id", 1], ["physician_id", 1], ["fecha", "2016-05-26 11:00:00.000000"], ["reminded", "f"], ["created_at", "2016-05-13 23:18:40.738256"], ["updated_at", "2016-05-13 23:18:40.738256"]]
---
	def create
		# @patient = Patient.find(params[:patient_id])
		# @physician = Physician.find(params[:physician_id])
		@appointment = Appointment.new(appointments_params)

		if @appointment.save