app/controllers/password_resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "chalado1@yahoo.com"]]
---
	def create
		@user = User.find_by_email(params[:user][:email])

SELECT  "users".* FROM "users" WHERE "users"."perishable_token" = ? LIMIT 1  [["perishable_token", "CGeXycOEuWbk0qG5Th"]]
---
	def edit
		@user = User.find_by(perishable_token: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."perishable_token" = ? LIMIT 1  [["perishable_token", "CGeXycOEuWbk0qG5Th"]]
UPDATE "users" SET "password_salt" = ?, "crypted_password" = ?, "persistence_token" = ?, "perishable_token" = ?, "login_count" = ?, "last_login_at" = ?, "current_login_at" = ?, "current_login_ip" = ?, "last_request_at" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
	def update
		@user = User.find_by(perishable_token: params[:id])
		if @user.update_attributes(password_reset_params)