app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients" INNER JOIN "us_pat_rels" ON "us_pat_rels"."patient_id" = "patients"."id" WHERE (user_id = 1)  ORDER BY lower(appat) asc, lower(apmat) asc, lower(name) asc
---
	def index
		# @patients = Patient.all
		@patients = Patient.joins(:us_pat_rels).where("user_id = ?", current_user.id)

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@patient = Patient.find(params[:id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 2]]
---
	def edit
		@patient = Patient.find(params[:id])

INSERT INTO "patients" ("appat", "apmat", "name", "sex", "age", "eciv", "calle", "cnum", "tcasa", "tof", "cel", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "us_pat_rels" ("user_id", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["patient_id", 1], ["created_at", "2016-05-12 18:33:05.033358"], ["updated_at", "2016-05-12 18:33:05.033358"]]
---
	def create
		@patient = Patient.new(patient_params)

		if @patient.save
			@us_pat_rel = UsPatRel.new user_id: current_user.id, patient_id: @patient.id
			@us_pat_rel.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 2]]
---
	def update
		@patient = Patient.find(params[:id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
---
	def correo
		@patient = Patient.find(params[:id])