app/controllers/physicians_controller.rb

SELECT "physicians".* FROM "physicians" INNER JOIN "us_phys_rels" ON "us_phys_rels"."physician_id" = "physicians"."id" WHERE (user_id = 1)  ORDER BY lower(name) asc
---
	def index
		# @physicians = Physician.all
		@physicians = Physician.joins(:us_phys_rels).where("user_id = ?", current_user.id)

SELECT  "physicians".* FROM "physicians" WHERE "physicians"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@physician = Physician.find(params[:id])

SELECT  "physicians".* FROM "physicians" WHERE "physicians"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@physician = Physician.find(params[:id])

INSERT INTO "physicians" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "El Santo"], ["created_at", "2016-05-13 18:37:23.456775"], ["updated_at", "2016-05-13 18:37:23.456775"]]
INSERT INTO "us_phys_rels" ("user_id", "physician_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["physician_id", 1], ["created_at", "2016-05-13 18:37:27.795684"], ["updated_at", "2016-05-13 18:37:27.795684"]]
---
	def create
		@physician = Physician.new(physician_params)

		if @physician.save
			@us_phys_rel = UsPhysRel.new user_id: current_user.id, physician_id: @physician.id
			@us_phys_rel.save