app/controllers/records_controller.rb

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "records" ("fecha", "body", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["fecha", "2016-05-13 13:11:07.000000"], ["body", "Esta es una nota"], ["patient_id", 2], ["created_at", "2016-05-13 18:11:16.230843"], ["updated_at", "2016-05-13 18:11:16.230843"]]
---
	def create
		@patient = Patient.find(params[:patient_id])
		@record = @patient.records.create(record_params)