app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_salt", "crypted_password", "persistence_token", "perishable_token", "login_count", "current_login_at", "current_login_ip", "last_request_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(users_params)
		if @user.save