app/views/appointments/new.html.erb

	<p>
		Doctor: <%= f.select :physician_id, options_from_collection_for_select(Physician.joins(:us_phys_rels).where("user_id = ?", current_user.id).order("lower(name) asc"), :id, :name) %>
---
SELECT "physicians".* FROM "physicians" INNER JOIN "us_phys_rels" ON "us_phys_rels"."physician_id" = "physicians"."id" WHERE (user_id = 1)  ORDER BY lower(name) asc

	<p>
		Paciente: <%= f.select :patient_id, options_from_collection_for_select(Patient.joins(:us_pat_rels).where("user_id = ?", current_user.id).order("lower(appat) asc", "lower(apmat) asc", "lower(name) asc"), :id, :full_name) %>
---
SELECT "patients".* FROM "patients" INNER JOIN "us_pat_rels" ON "us_pat_rels"."patient_id" = "patients"."id" WHERE (user_id = 1)  ORDER BY lower(appat) asc, lower(apmat) asc, lower(name) asc